УТ_для_edt/src/InformationRegisters/CRM_ЗаполненностьРеквизитовОбъектов/CRM_ЗаполненностьРеквизитовОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>CRM_ЗаполненностьРеквизитовОбъектов</name>
  <resources>
    <name>ВсегоРеквизитов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЗаполненоРеквизитов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПроцентЗаполненностиОбщий</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>CatalogRef.Партнеры</types>
      <types>CatalogRef.КонтактныеЛицаПартнеров</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt/src/InformationRegisters/CRM_ЗаполненностьРеквизитовПроцессовОбъектов/CRM_ЗаполненностьРеквизитовПроцессовОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>CRM_ЗаполненностьРеквизитовПроцессовОбъектов</name>
  <resources>
    <name>ВсегоРеквизитов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЗаполненоРеквизитов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПроцентЗаполненностиОбщий</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>AnyRef</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt/src/InformationRegisters/CRM_ОбъектыЗначенийКлассификаторов/CRM_ОбъектыЗначенийКлассификаторов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>CRM_ОбъектыЗначенийКлассификаторов</name>
  <resources>
    <name>ЗначениеРеквизита</name>
    <type>
      <types>Characteristic.CRM_ДополнительныеРеквизитыКлассификаторов</types>
    </type>
  </resources>
  <attributes>
    <name>ДатаВключения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ХранитьИсториюИзменения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>Characteristic.CRM_Классификаторы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Аналитика</name>
    <type>
      <types>Characteristic.CRM_АналитикаКлассификаторов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗначениеКлассификатора</name>
    <type>
      <types>CatalogRef.CRM_ЗначенияКлассификаторов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt/src/Catalogs/КонтактныеЛицаПартнеров/КонтактныеЛицаПартнеров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КонтактныеЛицаПартнеров</name>
  <basedOn>Catalog.Партнеры</basedOn>
  <owners>Catalog.Партнеры</owners>
  <attributes>
    <name>ДатаРегистрацииСвязи</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CRM_Ключевой</name>
    <comment>Ключевой контакт</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ЛичныеИнтересы</name>
    <comment>Личные интересы контактного лица</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_НапоминатьОДнеРождения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ОтписалсяОтEmailРассылок</name>
    <comment>Отписался от рассылок</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_Отчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CRM_РольКонтактногоЛица</name>
    <type>
      <types>CatalogRef.РолиКонтактныхЛицПартнеров</types>
    </type>
  </attributes>
  <attributes>
    <name>смартЭлектроннаяПочтаНаСайте</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>смартЛогинНаСайте</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CRM_Состояние</name>
    <type>
      <types>EnumRef.CRM_Состояние</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_СтатусыПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CRM_УчаствуетВАнкетировании</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_Фамилия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CRM_Фотография</name>
    <comment>Фотография клиента частное лицо</comment>
    <type>
      <types>CatalogRef.КонтактныеЛицаПартнеровПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_Должность</name>
    <type>
      <types>CatalogRef.CRM_Должности</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПрекращенияСвязи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.ВнешниеПользователи</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительнаяИнформация</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДолжностьПоВизитке</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пол</name>
    <type>
      <types>EnumRef.ПолФизическогоЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>сфпCoMagicID</name>
    <comment>Идентификатор контакта в системе CoMagic</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>сфпПользовательДляПереключенияЗвонков</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьCRM_Взаимодействия</name>
    <comment>Взаимодействия</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьCRM_ВладелецБизнеса</name>
    <comment>Владелец бизнеса</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьCRM_Заказчик</name>
    <comment>Заказчик</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьCRM_Противник</name>
    <comment>Противник</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьCRM_Прочее</name>
    <comment>Прочее</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьCRM_Спонсор</name>
    <comment>Спонсор</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьCRM_Сторонник</name>
    <comment>Сторонник</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьCRM_ТипОтношенийПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>смартТелефонНаСайте</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>смартИдентификаторБитрикс</name>
    <comment>//++ #Б3686 смарт: Шляпников 03.07.2025 / Проект smart-t.ru. API. Выгрузка &quot;Личный кабинет&quot;</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>смартАктивностьНаСайте</name>
    <comment>//++ #Б3686 смарт: Шляпников 03.07.2025 / Проект smart-t.ru. API. Выгрузка &quot;Личный кабинет&quot;</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>CRM_ОсновнойДляСвязи</name>
      <comment>Основной вид контактной информации для связи</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>сфпВремяЗадержкиНабораДобавочногоНомера</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РолиКонтактногоЛица</name>
    <attributes>
      <name>РольКонтактногоЛица</name>
      <type>
        <types>CatalogRef.РолиКонтактныхЛицПартнеров</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>CRM_ДополнительнаяИнформация</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.CRM_ДополнительнаяИнформация</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.CRM_ДополнительнаяИнформация</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаРегистрации</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>CRM_КлючевыеСобытия</name>
    <comment>Ключевые события контакта</comment>
    <attributes>
      <name>ВидСобытия</name>
      <comment>Вид ключевого события</comment>
      <type>
        <types>CatalogRef.CRM_ВидыКлючевыхСобытий</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаСобытия</name>
      <comment>Дата ключевого события</comment>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НапоминатьОСобытии</name>
      <comment>Напоминать о ключевом событии</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>CRM_Статусы</name>
    <attributes>
      <name>Статус</name>
      <type>
        <types>CatalogRef.CRM_СтатусыКонтактныхЛиц</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>CRM_Теги</name>
    <attributes>
      <name>Тег</name>
      <type>
        <types>CatalogRef.CRM_Теги</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ_для_edt/src/CommonModules/CRM_КонтрольЗаполненностиРеквизитовОбъектов/Module.bsl
#Область ПрограммныйИнтерфейс

// Выполняет расчет.
//
Процедура ВыполнитьРасчет() Экспорт
	Если ОбщегоНазначения.РазделениеВключено() И Не ОбщегоНазначения.ДоступноИспользованиеРазделенныхДанных() Тогда
		Возврат;
	КонецЕсли;
	УстановитьПривилегированныйРежим(Истина);
	
	ПараметрыКонтроля = CRM_КонтрольЗаполненностиРеквизитовОбъектовПовтИсп.ПараметрыКонтроляЗаполненностиРеквизитов();
	Если ПараметрыКонтроля = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// Контроль реквизитов
	Для каждого КлючЗначение Из ПараметрыКонтроля.ПараметрыКонтроляРеквизитов Цикл
		ВыполнитьРасчетЗаполненостиРеквизитовОбъекта(КлючЗначение);
	КонецЦикла;
	
	// Контроль реквизитов процессов
	Для каждого КлючЗначение Из ПараметрыКонтроля.ПараметрыКонтроляПроцесса Цикл
		ВыполнитьРасчетЗаполненостиРеквизитовПроцессаОбъекта(КлючЗначение);
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
		
КонецПроцедуры

// Выполняет расчет заполнености реквизитов объекта.
//
// Параметры:
//  КлючЗначение - КлючИЗначение - ключ и значение.
//  ОбъектСсылка - Ссылка - Ссылка на объект.
//
Процедура ВыполнитьРасчетЗаполненостиРеквизитовОбъекта(КлючЗначение, ОбъектСсылка = Неопределено) Экспорт

	ДанныеРасчета = ПолучитьДанныеРасчетаЗаполнености(КлючЗначение, ОбъектСсылка);
	
	CRM_КонтрольЗаполненностиРеквизитовОбъектовПереопределяемый.ДополнитьДанныеРасчетаЗаполнености(КлючЗначение, ДанныеРасчета);

	Для каждого ОписаниеОбъектаРасчета Из ДанныеРасчета Цикл
		
		Если ТипЗнч(ОписаниеОбъектаРасчета.Значение) = Тип("Структура") Тогда
			// Запись в регистр
			МенеджерЗаполненности = РегистрыСведений.CRM_ЗаполненностьРеквизитовОбъектов.СоздатьМенеджерЗаписи();
			
			ЗаполнитьЗначенияСвойств(МенеджерЗаполненности, ОписаниеОбъектаРасчета.Значение);
			
			МенеджерЗаполненности.Объект = ОписаниеОбъектаРасчета.Ключ;
			
			МенеджерЗаполненности.Записать();
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры // ВыполнитьРасчетЗаполнености()

// Выполняет расчет заполнености реквизитов процесса объекта.
//
// Параметры:
//  КлючЗначение - КлючИЗначение - ключ и значение.
//  ОбъектСсылка - Ссылка - Ссылка на объект.
//
Процедура ВыполнитьРасчетЗаполненостиРеквизитовПроцессаОбъекта(КлючЗначение, ОбъектСсылка = Неопределено) Экспорт

	ДанныеРасчета = ПолучитьДанныеРасчетаЗаполнености(КлючЗначение, ОбъектСсылка);
	Для каждого ОписаниеОбъектаРасчета Из ДанныеРасчета Цикл
		// Запись в регистр
		МенеджерЗаполненности = РегистрыСведений.CRM_ЗаполненностьРеквизитовПроцессовОбъектов.СоздатьМенеджерЗаписи();
		
		ЗаполнитьЗначенияСвойств(МенеджерЗаполненности, ОписаниеОбъектаРасчета.Значение);
		МенеджерЗаполненности.Объект = ОписаниеОбъектаРасчета.Ключ;
		
		МенеджерЗаполненности.Записать();
		
	КонецЦикла;
	
КонецПроцедуры // ВыполнитьРасчетЗаполнености()

// Получает данные расчета заполнености.
//
// Параметры:
//  КлючЗначение - КлючИЗначение - ключ и значение.
//  ОбъектСсылка - Ссылка - Ссылка на объект.
// 
// Возвращаемое значение:
//  Соответствие - данные расчета заполнености.
//
Функция ПолучитьДанныеРасчетаЗаполнености(Знач КлючЗначение, ОбъектСсылка = Неопределено) Экспорт

	СоответствиеОбъектов = Новый Соответствие;
	МетаданныеОбъекта    = Метаданные.НайтиПоПолномуИмени(КлючЗначение.Ключ);
	
	ПараметрыЖурнала = Новый Структура("ГруппаСобытий, Метаданные, Данные");
	ПараметрыЖурнала.ГруппаСобытий = НСтр("ru='Расчет заполненности реквизитов объектов.';en='Calculate of object attribute fullness.'");
	ПараметрыЖурнала.Метаданные    = МетаданныеОбъекта;
	Если МетаданныеОбъекта = Неопределено Тогда
		ЗаписьЖурнала(ПараметрыЖурнала, , ,
			НСтр("ru='Ошибка расчета заполненности объекта метаданных %1';en='Error of fullness calculation of metadata object %1'"), , 
			"'"+ КлючЗначение.Ключ +"'"
		);
		
		Возврат СоответствиеОбъектов;
		
	КонецЕсли;
	
	// Общие параметры
	ПараметрыКонтроляОбъекта = КлючЗначение.Значение;
	
	Если ПараметрыКонтроляОбъекта = Неопределено Тогда
		Возврат СоответствиеОбъектов;
	КонецЕсли;
	
	ВсегоРеквизитов = 0;
	
	ЗначенияОбщие		   = Новый Структура;
	ЗначенияСвойств		   = Новый Структура;
	ЗначенияКИ      	   = Новый Структура;
	ЗначенияКлассификаторы = Новый Структура;
	ЗначенияВидыФайлов     = Новый Структура;
	
	СхемаЗапроса = Новый СхемаЗапроса;
	
	#Область ФормированиеВременныхТаблиц
		
	// Дополнительные реквизиты
	Если ПараметрыКонтроляОбъекта.Свойство("ДополнительныйРеквизитОбъекта") Тогда
		ЗапросСхемы = СхемаЗапроса.ПакетЗапросов.Добавить();
		ЗапросСхемы.ТаблицаДляПомещения = "ДополнительныйРеквизитОбъекта";
		
		ОператорыЗапроса = ЗапросСхемы.Операторы[0];
		
		Источник = ОператорыЗапроса.Источники.Добавить(КлючЗначение.Ключ + ".ДополнительныеРеквизиты", "ДополнительныеРеквизитыОбъекта");
		
		ОператорыЗапроса.ВыбираемыеПоля.Добавить("ДополнительныеРеквизитыОбъекта.Ссылка");
		ОператорыЗапроса.ВыбираемыеПоля.Добавить("ДополнительныеРеквизитыОбъекта.Свойство");
		ОператорыЗапроса.ВыбираемыеПоля.Добавить("ДополнительныеРеквизитыОбъекта.Значение");
		
		ЗапросСхемы.Колонки[0].Псевдоним = "Объект";
		
		ЗапросСхемы.Индекс.Добавить(ЗапросСхемы.Колонки[0]);
		ЗапросСхемы.Индекс.Добавить(ЗапросСхемы.Колонки[1]);
		
		ОператорыЗапроса.Отбор.Добавить("ДополнительныеРеквизитыОбъекта.Свойство В (&ДополнительныйРеквизитОбъекта)");
		ЗначенияОбщие.Вставить("ДополнительныйРеквизитОбъекта", ПараметрыКонтроляОбъекта.ДополнительныйРеквизитОбъекта);
		
		Если ЗначениеЗаполнено(ОбъектСсылка) Тогда
			ОператорыЗапроса.Отбор.Добавить("ДополнительныеРеквизитыОбъекта.Ссылка = &Ссылка");
		КонецЕсли;
		
	КонецЕсли;
	
	// Виды контактной информации
	Сч = 1;
	Если ПараметрыКонтроляОбъекта.Свойство("ВидКонтактнойИнформацииОбъекта") Тогда
		ЗапросСхемы = СхемаЗапроса.ПакетЗапросов.Добавить();
		ЗапросСхемы.ТаблицаДляПомещения = "ВидКонтактнойИнформацииОбъекта";
		
		ОператорыЗапроса = ЗапросСхемы.Операторы[0];
		
		Источник = ОператорыЗапроса.Источники.Добавить(КлючЗначение.Ключ + ".КонтактнаяИнформация", "КонтактнаяИнформацияОбъекта");
		
		ОператорыЗапроса.ВыбираемыеПоля.Добавить("КонтактнаяИнформацияОбъекта.Ссылка");
		ОператорыЗапроса.ВыбираемыеПоля.Добавить("КонтактнаяИнформацияОбъекта.Вид");
		ОператорыЗапроса.ВыбираемыеПоля.Добавить("КонтактнаяИнформацияОбъекта.Представление");
		
		ЗапросСхемы.Колонки[0].Псевдоним = "Объект";
		
		ЗапросСхемы.Индекс.Добавить(ЗапросСхемы.Колонки[0]);
		ЗапросСхемы.Индекс.Добавить(ЗапросСхемы.Колонки[1]);
		
		ОператорыЗапроса.Отбор.Добавить("КонтактнаяИнформацияОбъекта.Вид В (&ВидКонтактнойИнформацииОбъекта)");
		ЗначенияОбщие.Вставить("ВидКонтактнойИнформацииОбъекта", ПараметрыКонтроляОбъекта.ВидКонтактнойИнформацииОбъекта);
		
		Если ЗначениеЗаполнено(ОбъектСсылка) Тогда
			ОператорыЗапроса.Отбор.Добавить("КонтактнаяИнформацияОбъекта.Ссылка = &Ссылка");
		КонецЕсли;
		
	КонецЕсли;
	
	// Классификаторы
	Если ПараметрыКонтроляОбъекта.Свойство("КлассификаторОбъекта") Тогда
		ЗапросСхемы = СхемаЗапроса.ПакетЗапросов.Добавить();
		ЗапросСхемы.ТаблицаДляПомещения = "КлассификаторОбъекта";
		
		ОператорыЗапроса = ЗапросСхемы.Операторы[0];
		
		Источник = ОператорыЗапроса.Источники.Добавить("РегистрСведений.CRM_ОбъектыЗначенийКлассификаторов", "ОбъектыЗначенийКлассификаторов");
		
		ОператорыЗапроса.ВыбираемыеПоля.Добавить("ОбъектыЗначенийКлассификаторов.Объект");
		ОператорыЗапроса.ВыбираемыеПоля.Добавить("ОбъектыЗначенийКлассификаторов.ЗначениеКлассификатора.Владелец");
		ОператорыЗапроса.ВыбираемыеПоля.Добавить("КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ОбъектыЗначенийКлассификаторов.ЗначениеКлассификатора)");
		
		ЗапросСхемы.Колонки[0].Псевдоним = "Объект";
		ЗапросСхемы.Колонки[1].Псевдоним = "Классификатор";
		ЗапросСхемы.Колонки[2].Псевдоним = "ЗначенийКлассификатора";
		
		ОператорыЗапроса.Группировка.Добавить("ОбъектыЗначенийКлассификаторов.Объект");
		ОператорыЗапроса.Группировка.Добавить("ОбъектыЗначенийКлассификаторов.ЗначениеКлассификатора.Владелец");
		
		Если ЗначениеЗаполнено(ОбъектСсылка) Тогда
			ОператорыЗапроса.Отбор.Добавить("ОбъектыЗначенийКлассификаторов.Объект = &Ссылка");
		КонецЕсли;
		
		ЗапросСхемы.Индекс.Добавить(ЗапросСхемы.Колонки[0]);
		ЗапросСхемы.Индекс.Добавить(ЗапросСхемы.Колонки[1]);
		
	КонецЕсли;
	
	// Виды присоединенных файлов
	Если ПараметрыКонтроляОбъекта.Свойство("ВидыПрисоединенныхФайловОбъекта") Тогда
		ЗапросСхемы = СхемаЗапроса.ПакетЗапросов.Добавить();
		ЗапросСхемы.ТаблицаДляПомещения = "ВидыПрисоединенныхФайловОбъекта";
		
		ОператорыЗапроса = ЗапросСхемы.Операторы[0];
		
		Источник = ОператорыЗапроса.Источники.Добавить("РегистрСведений.вогПрисоедниненныеФайлыОбъектовПоВидам", "ПрисоедниненныеФайлыОбъектовПоВидам");
		
		ОператорыЗапроса.ВыбираемыеПоля.Добавить("ПрисоедниненныеФайлыОбъектовПоВидам.ПрисоединенныйФайл.ВладелецФайла");
		ОператорыЗапроса.ВыбираемыеПоля.Добавить("ПрисоедниненныеФайлыОбъектовПоВидам.ВидФайла");
		ОператорыЗапроса.ВыбираемыеПоля.Добавить("КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ПрисоедниненныеФайлыОбъектовПоВидам.ПрисоединенныйФайл)");
		
		ЗапросСхемы.Колонки[0].Псевдоним = "Объект";
		ЗапросСхемы.Колонки[1].Псевдоним = "ВидФайла";
		ЗапросСхемы.Колонки[2].Псевдоним = "ПрисоединенныхФайлов";
		
		ОператорыЗапроса.Группировка.Добавить("ПрисоедниненныеФайлыОбъектовПоВидам.ПрисоединенныйФайл.ВладелецФайла");
		ОператорыЗапроса.Группировка.Добавить("ПрисоедниненныеФайлыОбъектовПоВидам.ВидФайла");
		
		ЗапросСхемы.Индекс.Добавить(ЗапросСхемы.Колонки[0]);
		ЗапросСхемы.Индекс.Добавить(ЗапросСхемы.Колонки[1]);
		
		ОператорыЗапроса.Отбор.Добавить("ПрисоедниненныеФайлыОбъектовПоВидам.ВидФайла В (&ВидыПрисоединенныхФайловОбъекта)");
		ЗначенияОбщие.Вставить("ВидыПрисоединенныхФайловОбъекта", ПараметрыКонтроляОбъекта.ВидыПрисоединенныхФайловОбъекта);
		
		Если ЗначениеЗаполнено(ОбъектСсылка) Тогда
			ОператорыЗапроса.Отбор.Добавить("ПрисоедниненныеФайлыОбъектовПоВидам.ПрисоединенныйФайл.ВладелецФайла = &Ссылка");
		КонецЕсли;
		
	КонецЕсли;
	
	#КонецОбласти
	
	#Область ФормированиеДанныхВыборки
	
	ЗапросСхемы 	 = СхемаЗапроса.ПакетЗапросов.Добавить();
	ОператорыЗапроса = ЗапросСхемы.Операторы[0];
	
	Источник = ОператорыЗапроса.Источники.Добавить(КлючЗначение.Ключ, "ТаблицаОбъектаКонтроля");
	
	// Поле ссылки
	ОператорыЗапроса.ВыбираемыеПоля.Добавить("ТаблицаОбъектаКонтроля.Ссылка");
	Если ЗначениеЗаполнено(ОбъектСсылка) Тогда
		ОператорыЗапроса.Отбор.Добавить("ТаблицаОбъектаКонтроля.Ссылка = &Ссылка");
		ЗначенияОбщие.Вставить("Ссылка", ОбъектСсылка);
	      
	КонецЕсли;
	
	// Проверка иерархиии
	Если МетаданныеОбъекта.Иерархический
	  И МетаданныеОбъекта.ВидИерархии = Метаданные.СвойстваОбъектов.ВидИерархии.ИерархияГруппИЭлементов Тогда
		ОператорыЗапроса.Отбор.Добавить("НЕ ТаблицаОбъектаКонтроля.ЭтоГруппа");
		
	КонецЕсли;
	
	// Реквизиты
	Если ПараметрыКонтроляОбъекта.Свойство("РеквизитОбъекта") Тогда
		ВсегоРеквизитов = ВсегоРеквизитов + ПараметрыКонтроляОбъекта.РеквизитОбъекта.Количество();
		Для каждого РеквизитОбъекта Из ПараметрыКонтроляОбъекта.РеквизитОбъекта Цикл
			Если МетаданныеОбъекта.Реквизиты.Найти(РеквизитОбъекта) <> Неопределено Тогда
				ОператорыЗапроса.ВыбираемыеПоля.Добавить("ТаблицаОбъектаКонтроля." + РеквизитОбъекта);
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	// Табличные части
	Если ПараметрыКонтроляОбъекта.Свойство("ТабличнаяЧастьОбъекта") Тогда
		ВсегоРеквизитов = ВсегоРеквизитов + ПараметрыКонтроляОбъекта.ТабличнаяЧастьОбъекта.Количество();
		Для каждого ТабличнаяЧастьОбъекта Из ПараметрыКонтроляОбъекта.ТабличнаяЧастьОбъекта Цикл
			Если МетаданныеОбъекта.ТабличныеЧасти.Найти(ТабличнаяЧастьОбъекта) <> Неопределено Тогда
				ОператорыЗапроса.ВыбираемыеПоля.Добавить("ТаблицаОбъектаКонтроля." + ТабличнаяЧастьОбъекта);
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	// Дополнительные реквизиты
	Сч = 1;
	Если ПараметрыКонтроляОбъекта.Свойство("ДополнительныйРеквизитОбъекта") Тогда
		ВсегоРеквизитов = ВсегоРеквизитов + ПараметрыКонтроляОбъекта.ДополнительныйРеквизитОбъекта.Количество();
		Для каждого ДополнительныйРеквизитОбъекта Из ПараметрыКонтроляОбъекта.ДополнительныйРеквизитОбъекта Цикл
			ПсевдонимТаблицы = "ДополнительныйРеквизитОбъекта" + Формат(Сч, "ЧГ=");
			ИсточникДополнительныеРеквизиты = ОператорыЗапроса.Источники.Добавить("ДополнительныйРеквизитОбъекта", ПсевдонимТаблицы);
			
			ИмяПараметра = "Свойство" + Формат(Сч, "ЧГ=");
			ЗначенияСвойств.Вставить(ИмяПараметра, ДополнительныйРеквизитОбъекта);
			
			ИсточникДополнительныеРеквизиты.Соединения.Очистить();
			ИсточникДополнительныеРеквизиты.Соединения.Добавить(Источник, "ТаблицаОбъектаКонтроля.Ссылка = " + ПсевдонимТаблицы + ".Объект И &" + ИмяПараметра + " = " + ПсевдонимТаблицы + ".Свойство");
			
			Для каждого Соединение Из ИсточникДополнительныеРеквизиты.Соединения Цикл
				Соединение.ТипСоединения = ТипСоединенияСхемыЗапроса.ПравоеВнешнее;
			КонецЦикла;
			
			ПолеВыражение = ОператорыЗапроса.ВыбираемыеПоля.Добавить(ПсевдонимТаблицы + ".Значение");
			ПолеВыражениеИндекс = ОператорыЗапроса.ВыбираемыеПоля.Индекс(ПолеВыражение);
			
			ЗапросСхемы.Колонки[ПолеВыражениеИндекс].Псевдоним = ИмяПараметра;
			
			Сч = Сч + 1;
			
		КонецЦикла;
		
	КонецЕсли;
	
	// Виды контактной информации
	Сч = 1;
	Если ПараметрыКонтроляОбъекта.Свойство("ВидКонтактнойИнформацииОбъекта") Тогда
		ВсегоРеквизитов = ВсегоРеквизитов + ПараметрыКонтроляОбъекта.ВидКонтактнойИнформацииОбъекта.Количество();
		Для каждого ВидКонтактнойИнформацииОбъекта Из ПараметрыКонтроляОбъекта.ВидКонтактнойИнформацииОбъекта Цикл
			ПсевдонимТаблицы = "ВидКонтактнойИнформацииОбъекта" + Формат(Сч, "ЧГ=");
			ИсточникВидыКонтактнойИнформации = ОператорыЗапроса.Источники.Добавить("ВидКонтактнойИнформацииОбъекта", ПсевдонимТаблицы);
			
			ИмяПараметра = "Вид" + Формат(Сч, "ЧГ=");
			ЗначенияКИ.Вставить(ИмяПараметра, ВидКонтактнойИнформацииОбъекта);
			
			ИсточникВидыКонтактнойИнформации.Соединения.Очистить();
			ИсточникВидыКонтактнойИнформации.Соединения.Добавить(Источник, "ТаблицаОбъектаКонтроля.Ссылка = " + ПсевдонимТаблицы + ".Объект И &" + ИмяПараметра + " = " + ПсевдонимТаблицы + ".Вид");
			
			Для каждого Соединение Из ИсточникВидыКонтактнойИнформации.Соединения Цикл
				Соединение.ТипСоединения = ТипСоединенияСхемыЗапроса.ПравоеВнешнее;
			КонецЦикла;
			
			ПолеВыражение = ОператорыЗапроса.ВыбираемыеПоля.Добавить(ПсевдонимТаблицы + ".Представление");
			ПолеВыражениеИндекс = ОператорыЗапроса.ВыбираемыеПоля.Индекс(ПолеВыражение);
			
			ЗапросСхемы.Колонки[ПолеВыражениеИндекс].Псевдоним = ИмяПараметра;
			
			Сч = Сч + 1;
			
		КонецЦикла;
		
	КонецЕсли;
		
	// Классификаторы
	Сч = 1;
	Если ПараметрыКонтроляОбъекта.Свойство("КлассификаторОбъекта") Тогда
		ВсегоРеквизитов = ВсегоРеквизитов + ПараметрыКонтроляОбъекта.КлассификаторОбъекта.Количество();  
		Для каждого КлассификаторОбъекта Из ПараметрыКонтроляОбъекта.КлассификаторОбъекта Цикл
			ПсевдонимТаблицы = "КлассификаторОбъекта" + Формат(Сч, "ЧГ=");
			ИсточникКлассификаторы = ОператорыЗапроса.Источники.Добавить("КлассификаторОбъекта", ПсевдонимТаблицы);
			
			ИмяПараметра = "Классификатор" + Формат(Сч, "ЧГ=");
			ЗначенияКлассификаторы.Вставить(ИмяПараметра, КлассификаторОбъекта);
			
			ИсточникКлассификаторы.Соединения.Очистить();
			ИсточникКлассификаторы.Соединения.Добавить(Источник, "ТаблицаОбъектаКонтроля.Ссылка = " + ПсевдонимТаблицы + ".Объект И &" + ИмяПараметра + " = " + ПсевдонимТаблицы + ".Классификатор");
			
			Для каждого Соединение Из ИсточникКлассификаторы.Соединения Цикл
				Соединение.ТипСоединения = ТипСоединенияСхемыЗапроса.ПравоеВнешнее;
			КонецЦикла;
			
			ПолеВыражение = ОператорыЗапроса.ВыбираемыеПоля.Добавить(ПсевдонимТаблицы + ".ЗначенийКлассификатора");
			ПолеВыражениеИндекс = ОператорыЗапроса.ВыбираемыеПоля.Индекс(ПолеВыражение);
			
			ЗапросСхемы.Колонки[ПолеВыражениеИндекс].Псевдоним = ИмяПараметра;
			
			Сч = Сч + 1;
			
		КонецЦикла;
		
	КонецЕсли;
	
	// Виды присоединенных файлов
	Сч = 1;
	Если ПараметрыКонтроляОбъекта.Свойство("ВидыПрисоединенныхФайловОбъекта") Тогда
		ВсегоРеквизитов = ВсегоРеквизитов + ПараметрыКонтроляОбъекта.ВидыПрисоединенныхФайловОбъекта.Количество();
		Для каждого ВидыПрисоединенныхФайловОбъекта Из ПараметрыКонтроляОбъекта.ВидыПрисоединенныхФайловОбъекта Цикл
			ПсевдонимТаблицы = "ВидыПрисоединенныхФайловОбъекта" + Формат(Сч, "ЧГ=");
			ИсточникВидыПрисоединенныхФайлов = ОператорыЗапроса.Источники.Добавить("ВидыПрисоединенныхФайловОбъекта", ПсевдонимТаблицы);
			
			ИмяПараметра = "ВидПрисоединенныхФайлов" + Формат(Сч, "ЧГ=");
			ЗначенияВидыФайлов.Вставить(ИмяПараметра, ВидыПрисоединенныхФайловОбъекта);
			
			ИсточникВидыПрисоединенныхФайлов.Соединения.Очистить();
			ИсточникВидыПрисоединенныхФайлов.Соединения.Добавить(Источник, "ТаблицаОбъектаКонтроля.Ссылка = " + ПсевдонимТаблицы + ".Объект И &" + ИмяПараметра + " = " + ПсевдонимТаблицы + ".ВидФайла");
			
			Для каждого Соединение Из ИсточникВидыПрисоединенныхФайлов.Соединения Цикл
				Соединение.ТипСоединения = ТипСоединенияСхемыЗапроса.ПравоеВнешнее;
			КонецЦикла;
			
			ПолеВыражение = ОператорыЗапроса.ВыбираемыеПоля.Добавить(ПсевдонимТаблицы + ".ПрисоединенныхФайлов");
			ПолеВыражениеИндекс = ОператорыЗапроса.ВыбираемыеПоля.Индекс(ПолеВыражение);
			
			ЗапросСхемы.Колонки[ПолеВыражениеИндекс].Псевдоним = ИмяПараметра;
			
			Сч = Сч + 1;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = СхемаЗапроса.ПолучитьТекстЗапроса();
	
	Для каждого КлючЗначениеПараметра Из ЗначенияОбщие Цикл
		Запрос.УстановитьПараметр(КлючЗначениеПараметра.Ключ, КлючЗначениеПараметра.Значение);
	КонецЦикла;
	
	Для каждого КлючЗначениеПараметра Из ЗначенияСвойств Цикл
		Запрос.УстановитьПараметр(КлючЗначениеПараметра.Ключ, КлючЗначениеПараметра.Значение);
	КонецЦикла;
	
	Для каждого КлючЗначениеПараметра Из ЗначенияКИ Цикл
		Запрос.УстановитьПараметр(КлючЗначениеПараметра.Ключ, КлючЗначениеПараметра.Значение);
	КонецЦикла;
	
	Для каждого КлючЗначениеПараметра Из ЗначенияКлассификаторы Цикл
		Запрос.УстановитьПараметр(КлючЗначениеПараметра.Ключ, КлючЗначениеПараметра.Значение);
	КонецЦикла;
	
	Для каждого КлючЗначениеПараметра Из ЗначенияВидыФайлов Цикл
		Запрос.УстановитьПараметр(КлючЗначениеПараметра.Ключ, КлючЗначениеПараметра.Значение);
	КонецЦикла;
	
	#КонецОбласти
	
	#Область ОбработкаДанныхВыборки
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		// Параметры
		ЗаполненоРеквизитов = 0;
		ВсегоРеквизитовПоВыборке = ВсегоРеквизитов;
		
		Если ВсегоРеквизитовПоВыборке = 0 Тогда
			СоответствиеОбъектов.Вставить(Выборка.Ссылка,
				Новый Структура("ВсегоРеквизитов, ЗаполненоРеквизитов, ПроцентЗаполненностиОбщий", 0, 0, 100));
			Продолжить;
		КонецЕсли;
		
		// Реквизиты
		Если ПараметрыКонтроляОбъекта.Свойство("РеквизитОбъекта") Тогда
			Для каждого РеквизитОбъекта Из ПараметрыКонтроляОбъекта.РеквизитОбъекта Цикл
				Если МетаданныеОбъекта.Реквизиты.Найти(РеквизитОбъекта) <> Неопределено Тогда
					Если ЗначениеЗаполнено(Выборка[РеквизитОбъекта]) Тогда
						ЗаполненоРеквизитов = ЗаполненоРеквизитов + 1;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
			
		КонецЕсли;

		// Табличные части
		Если ПараметрыКонтроляОбъекта.Свойство("ТабличнаяЧастьОбъекта") Тогда
			Для каждого ТабличнаяЧастьОбъекта Из ПараметрыКонтроляОбъекта.ТабличнаяЧастьОбъекта Цикл
				Если МетаданныеОбъекта.ТабличныеЧасти.Найти(ТабличнаяЧастьОбъекта) <> Неопределено Тогда
					Если Не Выборка[ТабличнаяЧастьОбъекта].Пустой() Тогда
						ЗаполненоРеквизитов = ЗаполненоРеквизитов + 1;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
			
			
		КонецЕсли;

		// Дополнительные реквизиты
		Если ПараметрыКонтроляОбъекта.Свойство("ДополнительныйРеквизитОбъекта") Тогда
			Для каждого КлючЗначение Из ЗначенияСвойств Цикл
				Если ЗначениеЗаполнено(Выборка[КлючЗначение.Ключ]) Тогда
					ЗаполненоРеквизитов = ЗаполненоРеквизитов + 1;
				
				КонецЕсли;
			КонецЦикла;
			
		КонецЕсли;
		
		// Виды контактной информации
		Если ПараметрыКонтроляОбъекта.Свойство("ВидКонтактнойИнформацииОбъекта") Тогда
			ВидыКИОбъекта = CRM_УправлениеКонтактнойИнформацией.ГруппыВидовКонтактнойИнформацииОбъектаПоСсылке(Выборка.Ссылка);
			Для каждого КлючЗначение Из ЗначенияКИ Цикл
				Если ВидыКИОбъекта.Найти(КлючЗначение.Значение.Родитель)<>Неопределено Тогда
					Если ЗначениеЗаполнено(Выборка[КлючЗначение.Ключ]) Тогда
						ЗаполненоРеквизитов = ЗаполненоРеквизитов + 1;
					КонецЕсли;
				Иначе
					ВсегоРеквизитовПоВыборке = ВсегоРеквизитовПоВыборке - 1;
				КонецЕсли;
			КонецЦикла;
			
		КонецЕсли;	
		
		// Классификаторы
		Если ПараметрыКонтроляОбъекта.Свойство("КлассификаторОбъекта") Тогда
			Для каждого КлючЗначение Из ЗначенияКлассификаторы Цикл
				Если ЗначениеЗаполнено(Выборка[КлючЗначение.Ключ]) Тогда
					ЗаполненоРеквизитов = ЗаполненоРеквизитов + 1;
				
				КонецЕсли;
			КонецЦикла;
			
		КонецЕсли;
		
		// Виды присоединенных файлов
		Если ПараметрыКонтроляОбъекта.Свойство("ВидыПрисоединенныхФайловОбъекта") Тогда
			Для каждого КлючЗначение Из ЗначенияВидыФайлов Цикл
				Если ЗначениеЗаполнено(Выборка[КлючЗначение.Ключ]) Тогда
					ЗаполненоРеквизитов = ЗаполненоРеквизитов + 1;
				
				КонецЕсли;
			КонецЦикла;
			
		КонецЕсли;
		
		ПроцентЗаполненностиОбщий = 100 * ЗаполненоРеквизитов / ВсегоРеквизитовПоВыборке;
		СоответствиеОбъектов.Вставить(Выборка.Ссылка,
			Новый Структура("ВсегоРеквизитов, ЗаполненоРеквизитов, ПроцентЗаполненностиОбщий", ВсегоРеквизитовПоВыборке, ЗаполненоРеквизитов, ПроцентЗаполненностиОбщий)
		);
		
	КонецЦикла;
	
	#КонецОбласти
	
	Возврат СоответствиеОбъектов;
	
КонецФункции // ВыполнитьРасчетЗаполнености()

// Записывает информацию в журнал.
//
// Параметры:
//  ПараметрыЖурнала		 - Структура - Параметры журнала.
//  УровеньЖурнала			 - УровеньЖурналаРегистрации - Уровень журнала регистрации.
//  ИмяСобытия				 - Строка - Имя события.
//  КомментарийСПараметрами	 - Строка - Комментарий с параметрами.
//  ИнформацияОбОшибке		 - ИнформацияОбОшибке - Информация об ошибке.
//  Параметр1				 - Строка - первый параметр.
//  Параметр2				 - Строка - второй параметр. 
//  Параметр3				 - Строка - третий параметр.
//  Параметр4				 - Строка - четвертый параметр.
//
Процедура ЗаписьЖурнала(ПараметрыЖурнала, УровеньЖурнала = Неопределено, ИмяСобытия = "", 
		Знач КомментарийСПараметрами = "", ИнформацияОбОшибке = Неопределено, 
		Параметр1 = Неопределено, 
		Параметр2 = Неопределено, 
		Параметр3 = Неопределено, 
		Параметр4 = Неопределено
	) Экспорт
	
	// Определение уровня журнала регистрации на основе типа переданного сообщения об ошибке.
	Если ТипЗнч(УровеньЖурнала) <> Тип("УровеньЖурналаРегистрации") Тогда
		Если ТипЗнч(ИнформацияОбОшибке) = Тип("Строка") Тогда
			УровеньЖурнала = УровеньЖурналаРегистрации.Предупреждение;
		ИначеЕсли ТипЗнч(ИнформацияОбОшибке) = Тип("ИнформацияОбОшибке") Тогда
			УровеньЖурнала = УровеньЖурналаРегистрации.Ошибка;
		Иначе
			УровеньЖурнала = УровеньЖурналаРегистрации.Информация;
		КонецЕсли;
	КонецЕсли;
	
	// Комментарий для журнала регистрации и пользователя.
	Если Параметр1 <> Неопределено Тогда
		КомментарийСПараметрами = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			КомментарийСПараметрами, Параметр1, Параметр2, Параметр3, Параметр4
		);
	КонецЕсли;
	
	Если ТипЗнч(ИнформацияОбОшибке) = Тип("ИнформацияОбОшибке") Тогда
		Если КомментарийСПараметрами = "" Тогда
			ТестСообщенияПользователю = КраткоеПредставлениеОшибки(ИнформацияОбОшибке);
			КомментарийСПараметрами = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
		Иначе
			ТестСообщенияПользователю = КомментарийСПараметрами + Символы.ПС + КраткоеПредставлениеОшибки(ИнформацияОбОшибке);
			КомментарийСПараметрами = КомментарийСПараметрами + Символы.ПС + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
		КонецЕсли;
	Иначе
		Если ТипЗнч(ИнформацияОбОшибке) = Тип("Строка") И ИнформацияОбОшибке <> "" Тогда
			КомментарийСПараметрами = КомментарийСПараметрами + Символы.ПС + ИнформацияОбОшибке;
		КонецЕсли;
		ТестСообщенияПользователю = КомментарийСПараметрами;
	КонецЕсли;
	
	// Журнал регистрации 
	УстановитьПривилегированныйРежим(Истина);
	ЗаписьЖурналаРегистрации(
		ПараметрыЖурнала.ГруппаСобытий + ?(ИмяСобытия = "", "", ". "+ ИмяСобытия), 
		УровеньЖурнала, 
		ПараметрыЖурнала.Метаданные, 
		ПараметрыЖурнала.Данные, 
		КомментарийСПараметрами
	);
	УстановитьПривилегированныйРежим(Ложь);
	
	Если УровеньЖурнала = УровеньЖурналаРегистрации.Ошибка ИЛИ УровеньЖурнала = УровеньЖурналаРегистрации.Предупреждение Тогда
		Если УровеньЖурнала = УровеньЖурналаРегистрации.Ошибка Тогда
			ПараметрыЖурнала.Вставить("БылиОшибки", Истина);
		Иначе
			ПараметрыЖурнала.Вставить("БылиПредупреждения", Истина);
		КонецЕсли;
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = СокрЛП(ТестСообщенияПользователю); //  + Символы.ПС + Символы.ПС + НСтр("ru='Подробности см. в журнале регистрации.';en='See details in event log.'")
		Сообщение.УстановитьДанные(ПараметрыЖурнала.Данные);
		Сообщение.Сообщить();
	КонецЕсли;
	
КонецПроцедуры

// Возвращает структуру заполнености объекта.
//
// Параметры:
//  ОбъектСсылка - Ссылка - Ссылка на объект.
// 
// Возвращаемое значение:
//  Структура - структура заполнености объекта.
//
Функция СтруктураЗаполненостиОбъекта(ОбъектСсылка) Экспорт
	
	Результат = Новый Структура("ПроцентЗаполненностиОбщий, Картинка", 0, БиблиотекаКартинок.Пустая);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ОбъектСсылка", ОбъектСсылка);
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаполненностьРеквизитовОбъектов.ПроцентЗаполненностиОбщий,
		|	ВЫБОР
		|		КОГДА ЗаполненностьРеквизитовОбъектов.ПроцентЗаполненностиОбщий < 25
		|			ТОГДА ""CRM_ПроцентВыполненияЗадачи_0""
		|		КОГДА ЗаполненностьРеквизитовОбъектов.ПроцентЗаполненностиОбщий < 50
		|			ТОГДА ""CRM_ПроцентВыполненияЗадачи_25""
		|		КОГДА ЗаполненностьРеквизитовОбъектов.ПроцентЗаполненностиОбщий < 75
		|			ТОГДА ""CRM_ПроцентВыполненияЗадачи_50""
		|		КОГДА ЗаполненностьРеквизитовОбъектов.ПроцентЗаполненностиОбщий < 90
		|			ТОГДА ""CRM_ПроцентВыполненияЗадачи_75""
		|		ИНАЧЕ ""CRM_ПроцентВыполненияЗадачи_100""
		|	КОНЕЦ КАК ИмяКартинки
		|ИЗ
		|	РегистрСведений.CRM_ЗаполненностьРеквизитовОбъектов КАК ЗаполненностьРеквизитовОбъектов
		|ГДЕ
		|	ЗаполненностьРеквизитовОбъектов.Объект = &ОбъектСсылка";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Результат.ПроцентЗаполненностиОбщий = Выборка.ПроцентЗаполненностиОбщий;
		Результат.Картинка = БиблиотекаКартинок[Выборка.ИмяКартинки];
	
	КонецЕсли;	

	Возврат Результат;
	
КонецФункции // СтруктураЗаполненостиОбъекта()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область События

Процедура РасчетЗаполненностиРеквизитовОбъектаПриЗаписи(Источник, Отказ) Экспорт
	
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Константы.ИспользоватьРазделениеПоОбластямДанных.Получить() И РольДоступна("АдминистраторСистемы") Тогда Возврат КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	ПараметрыКонтроля = CRM_КонтрольЗаполненностиРеквизитовОбъектовПовтИсп.ПараметрыКонтроляЗаполненностиРеквизитов();
	Если ПараметрыКонтроля = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Ключ = Источник.Метаданные().ПолноеИмя();
	
	// Контроль реквизитов
	ПараметрыКонтроляОбъекта = ПараметрыКонтроля.ПараметрыКонтроляРеквизитов.Получить(Ключ);
	Если ПараметрыКонтроляОбъекта <> Неопределено Тогда
		Если ПараметрыКонтроляОбъекта.РасчетПриЗаписи Тогда
			ВыполнитьРасчетЗаполненостиРеквизитовОбъекта(Новый Структура("Ключ, Значение", Ключ, ПараметрыКонтроляОбъекта),Источник.Ссылка); 
		КонецЕсли;

	КонецЕсли;
	
	// Контроль реквизитов процессов
	ПараметрыКонтроляПроцессов = ПараметрыКонтроля.ПараметрыКонтроляПроцесса.Получить(Ключ);
	Если ПараметрыКонтроляПроцессов <> Неопределено Тогда
		Если ПараметрыКонтроляПроцессов.РасчетПриЗаписи Тогда
			ВыполнитьРасчетЗаполненостиРеквизитовПроцессаОбъекта(Новый Структура("Ключ, Значение", Ключ, ПараметрыКонтроляПроцессов), Источник.Ссылка);
		КонецЕсли;

	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

#КонецОбласти

#Область ИсключаемыеРеквизиты

Функция ИсключаемыеРеквизитыКонтроляЗаполненностиОбъектов() Экспорт
	
	ИсключаемыеРеквизитыКонтроля = Новый Соответствие;
	
	// Партнеры
	МассивИсключаемыхРеквизитов = Новый Массив;
	МассивИсключаемыхРеквизитов.Добавить("ДатаРегистрации");
	МассивИсключаемыхРеквизитов.Добавить("CRM_Потенциал");
	МассивИсключаемыхРеквизитов.Добавить("CRM_Автор");
	МассивИсключаемыхРеквизитов.Добавить("сфпCoMagicID");
	МассивИсключаемыхРеквизитов.Добавить("сфпПользовательДляПереключенияЗвонков");
	
	ИсключаемыеРеквизитыКонтроля.Вставить("Справочник.Партнеры", МассивИсключаемыхРеквизитов);
	
	// КонтактныеЛицаПартнеров
	МассивИсключаемыхРеквизитов = Новый Массив;
	МассивИсключаемыхРеквизитов.Добавить("ДатаРегистрацииСвязи");
	МассивИсключаемыхРеквизитов.Добавить("ДатаПрекращенияСвязи");
	МассивИсключаемыхРеквизитов.Добавить("Автор");
	МассивИсключаемыхРеквизитов.Добавить("сфпCoMagicID");
	МассивИсключаемыхРеквизитов.Добавить("сфпПользовательДляПереключенияЗвонков");
	
	ИсключаемыеРеквизитыКонтроля.Вставить("Справочник.КонтактныеЛицаПартнеров", МассивИсключаемыхРеквизитов);
	
	Если Метаданные.ОбщиеМодули.Найти("CRM_Модуль_КонтрольЗаполненностиРеквизитовОбъектов") <> Неопределено Тогда
		CRM_Модуль = ОбщегоНазначения.ОбщийМодуль("CRM_Модуль_КонтрольЗаполненностиРеквизитовОбъектов");
		CRM_Модуль.ИсключаемыеРеквизитыКонтроляЗаполненностиОбъектов(ИсключаемыеРеквизитыКонтроля);
	КонецЕсли;
	
	Возврат ИсключаемыеРеквизитыКонтроля;
		
КонецФункции

#КонецОбласти

#Область НачальноеЗаполнение

Процедура НачальноеЗаполнениеНастроекКонтроляЗаполненностиОбъектов(Параметры = Неопределено) Экспорт
	
	Если ОбщегоНазначения.РазделениеВключено() И Не ОбщегоНазначения.ДоступноИспользованиеРазделенныхДанных() Тогда
		Возврат;
	КонецЕсли;
	УстановитьПривилегированныйРежим(Истина);
	
	ПараметрыКонтроля = Константы.CRM_ПараметрыКонтроляЗаполненностиРеквизитовОбъектов.Получить().Получить();
	Если ПараметрыКонтроля = Неопределено Тогда
	  	ПараметрыКонтроля = Новый Структура;
		ПараметрыКонтроляРеквизитов = Новый Соответствие;
		ПараметрыКонтроляПроцесса   = Новый Соответствие;
	Иначе
		ПараметрыКонтроляРеквизитов = ПараметрыКонтроля.ПараметрыКонтроляРеквизитов;
		ПараметрыКонтроляПроцесса   = ПараметрыКонтроля.ПараметрыКонтроляПроцесса;
	КонецЕсли;
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ВидыКонтактнойИнформации.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	Справочник.ВидыКонтактнойИнформации КАК ВидыКонтактнойИнформации
	                      |ГДЕ
	                      |	ВидыКонтактнойИнформации.Родитель В(&Родитель)
	                      |	И ВидыКонтактнойИнформации.CRM_Основной
	                      |	И НЕ ВидыКонтактнойИнформации.ПометкаУдаления");
	
	// Партнеры
	РасчетПриЗаписи = Истина;
	РеквизитОбъекта = Новый Массив;
	ДополнительныйРеквизитОбъекта = Новый Массив;
	ВидКонтактнойИнформацииОбъекта = Новый Массив;
	
	РеквизитОбъекта.Добавить("БизнесРегион");
	РеквизитОбъекта.Добавить("БизнесРегион");


	МассивРодителейВидовКИ = Новый Массив;
	МассивРодителейВидовКИ.Добавить(Справочники.ВидыКонтактнойИнформации.СправочникПартнеры);
	МассивРодителейВидовКИ.Добавить(Справочники.ВидыКонтактнойИнформации.CRM_СправочникПартнерыЧастноеЛицо);
	МассивРодителейВидовКИ.Добавить(Справочники.ВидыКонтактнойИнформации.CRM_СправочникПартнерыКомпания);
	
	Запрос.УстановитьПараметр("Родитель", МассивРодителейВидовКИ);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ВидКонтактнойИнформацииОбъекта.Добавить(Выборка.Ссылка);
	КонецЦикла;
		
	ПараметрыКонтроляРеквизитов.Вставить("Справочник.Партнеры", Новый Структура("РасчетПриЗаписи, РеквизитОбъекта, ДополнительныйРеквизитОбъекта, ВидКонтактнойИнформацииОбъекта", РасчетПриЗаписи, РеквизитОбъекта, ДополнительныйРеквизитОбъекта, ВидКонтактнойИнформацииОбъекта));
	
	// Контактные лица
	РасчетПриЗаписи = Истина;
	РеквизитОбъекта = Новый Массив;
	ВидКонтактнойИнформацииОбъекта = Новый Массив;
	
	РеквизитОбъекта.Добавить("CRM_Должность");

	МассивРодителейВидовКИ.Добавить(Справочники.ВидыКонтактнойИнформации.СправочникКонтактныеЛицаПартнеров);
	
	Запрос.УстановитьПараметр("Родитель", МассивРодителейВидовКИ);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ВидКонтактнойИнформацииОбъекта.Добавить(Выборка.Ссылка);
	КонецЦикла;
	
	ПараметрыКонтроляРеквизитов.Вставить("Справочник.КонтактныеЛицаПартнеров", Новый Структура("РасчетПриЗаписи, РеквизитОбъекта, ВидКонтактнойИнформацииОбъекта", РасчетПриЗаписи, РеквизитОбъекта, ВидКонтактнойИнформацииОбъекта));
	
	ПараметрыКонтроля.Вставить("ПараметрыКонтроляРеквизитов", ПараметрыКонтроляРеквизитов);
	ПараметрыКонтроля.Вставить("ПараметрыКонтроляПроцесса"  , ПараметрыКонтроляПроцесса);
	
	Константы.CRM_ПараметрыКонтроляЗаполненностиРеквизитовОбъектов.Установить(Новый ХранилищеЗначения(ПараметрыКонтроля, Новый СжатиеДанных(9)));
	
	// Запуск расчета заполненности
	Если НЕ Параметры.Свойство("ПервыйЗапуск") Тогда
		ВыполнитьРасчет();
	КонецЕсли;

	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

Процедура ОбработатьДанныеДляПереходаНаНовуюВерсию() Экспорт
	
	ПараметрыКонтроля = Константы.CRM_ПараметрыКонтроляЗаполненностиРеквизитовОбъектов.Получить().Получить();
	
	Если ТипЗнч(ПараметрыКонтроля) = Тип("Структура") Тогда
		Если ПараметрыКонтроля.Свойство("ПараметрыКонтроляРеквизитов") Тогда
			Для каждого Параметр из ПараметрыКонтроля.ПараметрыКонтроляРеквизитов Цикл
				Если Параметр.Значение.Свойство("РассчетПриЗаписи") Тогда
					Параметр.Значение.Вставить("РасчетПриЗаписи", Параметр.Значение["РассчетПриЗаписи"]);
					Параметр.Значение.Удалить("РассчетПриЗаписи")
				КонецЕсли;;
			КонецЦикла;
		КонецЕсли;
		
		Если ПараметрыКонтроля.Свойство("ПараметрыКонтроляПроцесса") Тогда
			Для каждого Параметр из ПараметрыКонтроля.ПараметрыКонтроляПроцесса Цикл
				Если Параметр.Значение.Свойство("РассчетПриЗаписи") Тогда
					Параметр.Значение.Вставить("РасчетПриЗаписи", Параметр.Значение["РассчетПриЗаписи"]);
					Параметр.Значение.Удалить("РассчетПриЗаписи")
				КонецЕсли;;
			КонецЦикла;
		КонецЕсли;
		Константы.CRM_ПараметрыКонтроляЗаполненностиРеквизитовОбъектов.Установить(Новый ХранилищеЗначения(ПараметрыКонтроля, Новый СжатиеДанных(9)));
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
